#Завдання 1. Створити функцію, що витягує з тексту усі слова паліндроми. 
#Назва функції - palindrom. Аргументи функції - text. Функція повинна повернути список слів.

def palindrom(text): 
  rev_str="".join(reversed(text)) #використав вбудовану функцію для пошуку слів паліндромів
  if (text == rev_str): 
    return True
  else:
    return False
    
my_text = ["rostyslav","eye","дід","око","телефон"] #набір слів для перевірки

palindromes_in_text = [string for string in my_text if palindrom(string)] #перевірка слів по порядку
print("В наборі слів є такі слoва паліндроми:",palindromes_in_text,"\n")

#Завдання 2: Створити функцію-валідатор IP-адреси. 
#Функція-валідатор - це функція, що перевіряє вхідне значення на певний тип даних. 
#Назва функції - validate_ip. Аргументи функції - ip_address. Функція повинна повернути булеве значення (True/False) 

def validate_ip(ip_adress):
    return isinstance(ip_adress, int)
    
print("Значення ІР-адреси:",validate_ip(19216808),"\n") #можливо неправильно зрозумів перевірку типу даних
#записував без розділення на октети,тому здійснюється перевірка тільки по типу даних чи це числа,якщо букви тоді False

#Завдання 3: Створити функцію, що повертає назву ОС з якої запущена програма. 
#Назва функції - get_os. Аргументи функції відсутні. 
#Функція повинна повернути одне із трьох значень - “Mac”, “Windows”, “Linux”. 

import os
import platform

def get_os():
    return platform.system() #назву операційної системи дінаємось за допомогою функції platform.system
    
print("Назва вашої операційної системи:", get_os())

